pkg/wsman/wsmantesting/responses/cim/powermanagementcapabilities/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope" xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust" xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:g="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_PowerManagementCapabilities" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <a:Header>
    <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
    <b:RelatesTo>2</b:RelatesTo>
    <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
    <b:MessageID>uuid:00000000-8086-8086-8086-0000000000C2</b:MessageID>
    <c:ResourceURI>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_PowerManagementCapabilities</c:ResourceURI>
  </a:Header>
  <a:Body>
    <g:CIM_PowerManagementCapabilities>
      <g:ElementName>Power Management Capabilities</g:ElementName>
      <g:InstanceID>Intel(r) AMT:PowerManagementCapabilities 0</g:InstanceID>
      <g:OtherPowerChangeCapabilities/>
      <g:PowerChangeCapabilities>2</g:PowerChangeCapabilities>
      <g:PowerChangeCapabilities>3</g:PowerChangeCapabilities>
      <g:PowerChangeCapabilities>4</g:PowerChangeCapabilities>
      <g:PowerChangeCapabilities>7</g:PowerChangeCapabilities>
      <g:PowerChangeCapabilities>8</g:PowerChangeCapabilities>
      <g:PowerStatesSupported>5</g:PowerStatesSupported>
      <g:PowerStatesSupported>8</g:PowerStatesSupported>
      <g:PowerStatesSupported>2</g:PowerStatesSupported>
      <g:PowerStatesSupported>10</g:PowerStatesSupported>
      <g:PowerStatesSupported>11</g:PowerStatesSupported>
      <g:PowerStatesSupported>12</g:PowerStatesSupported>
      <g:PowerStatesSupported>14</g:PowerStatesSupported>
      <g:RequestedPowerStatesSupported>5</g:RequestedPowerStatesSupported>
      <g:RequestedPowerStatesSupported>8</g:RequestedPowerStatesSupported>
      <g:RequestedPowerStatesSupported>2</g:RequestedPowerStatesSupported>
      <g:RequestedPowerStatesSupported>10</g:RequestedPowerStatesSupported>
      <g:RequestedPowerStatesSupported>11</g:RequestedPowerStatesSupported>
      <g:RequestedPowerStatesSupported>12</g:RequestedPowerStatesSupported>
      <g:RequestedPowerStatesSupported>14</g:RequestedPowerStatesSupported>
    </g:CIM_PowerManagementCapabilities>
  </a:Body>
</a:Envelope>
